import img1 from "./pics/product1.jpg";
import img2 from "./pics/product2.jpg";
import img3 from "./pics/product3.jpg";
import img4 from "./pics/product4.jpg";
import img5 from "./pics/product5.jpg";
import img6 from "./pics/product6.jpg";
import img7 from "./pics/product7.jpg";
import img8 from "./pics/product8.jpg";
import img9 from "./pics/product9.jpg";
import img10 from "./pics/product10.jpg";

const products = [
  {
    id: 1,
    name: "Тарелка ручной работы",
    price: 500,
    image: img1,
    category: "Тарелки",
    description: "Эта уникальная тарелка выполнена вручную, что делает её особенной. Каждый элемент тщательно отшлифован, а дизайн вдохновлен природными мотивами. Подходит для сервировки как для повседневных приемов пищи, так и для особых случаев. Размер: Диаметр 25 см."
  },
  {
    id: 2,
    name: "Подставка из дерева",
    price: 500,
    image: img2,
    category: "Подставки",
    description: "Стильная деревянная подставка, идеально подходящая для размещения горячих кастрюль или чайников. Изготовлена из прочного и экологически чистого дерева, что придает ей природный и утонченный вид. Размер: 20 x 20 см."
  },
  {
    id: 3,
    name: "Брелок для ключей",
    price: 500,
    image: img3,
    category: "Брелки",
    description: "Практичный и стильный брелок для ключей, выполненный из качественного материала. Он поможет вам всегда находить ключи в сумке или рюкзаке, а также станет отличным аксессуаром. Размер: 5 x 3 см."
  },
  {
    id: 4,
    name: "Брелки с котятами",
    price: 500,
    image: img4,
    category: "Брелки",
    description: "Милые брелки с изображением котят, которые привнесут радость и уют в вашу повседневную жизнь. Сделаны с любовью и вниманием к деталям, идеально подходят для подарка. Размер: 4 x 4 см."
  },
  {
    id: 5,
    name: "Тарелка большая",
    price: 500,
    image: img5,
    category: "Тарелки",
    description: "Большая тарелка с классическим дизайном, которая идеально подойдет для подачи основных блюд или десертов. Изготовлена из высококачественной керамики и легко моется. Размер: Диаметр 30 см."
  },
  {
    id: 6,
    name: "Салфетница",
    price: 500,
    image: img6,
    category: "Подставки",
    description: "Удобная и стильная салфетница из дерева, которая отлично впишется в интерьер вашего стола. Идеальна для хранения салфеток и аксессуаров на кухне или в столовой. Размер: 15 x 10 см."
  },
  {
    id: 7,
    name: "Брелок для сумки",
    price: 500,
    image: img7,
    category: "Брелки",
    description: "Элегантный брелок, который станет прекрасным дополнением для вашей сумки. Простой, но стильный дизайн, выполненный из качественного материала, сделает вашу сумку еще более привлекательной. Размер: 6 x 3 см."
  },
  {
    id: 8,
    name: "Тарелка в виде кота",
    price: 500,
    image: img8,
    category: "Тарелки",
    description: "Оригинальная тарелка в форме кота, которая привнесет уют и веселье в ваш обеденный стол. Подходит как для детей, так и для любителей необычных предметов. Размер: 25 x 25 см."
  },
  {
    id: 9,
    name: "Шпилька для волос",
    price: 500,
    image: img9,
    category: "Украшения",
    description: "Красивое украшение для волос, которое придаст вашему образу завершенность. Шпилька выполнена с тонкой деталировкой и добавит элегантности любому прическе. Размер: 10 см."
  },
  {
    id: 10,
    name: "Подставка с надписью",
    price: 500,
    image: img10,
    category: "Подставки",
    description: "Подставка с оригинальной надписью, которая может стать как функциональным, так и декоративным элементом в вашем доме. Подходит для размещения чашек, кастрюль или других аксессуаров. Размер: 18 x 18 см."
  },
];

export default products;